Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/cru.h
/* -------- CRU_SPLLCONCLR : (CRU Offset: 0x24) (R/W 32)  -------- */
#define CRU_SPLLCONCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_SPLLCONCLR)   Reset Value */

#define CRU_SPLLCONCLR_Msk                    _UINT32_(0x00000000)                                 /* (CRU_SPLLCONCLR) Register Mask  */


/* -------- CRU_SPLLCONSET : (CRU Offset: 0x28) (R/W 32)  -------- */
#define CRU_SPLLCONSET_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_SPLLCONSET)   Reset Value */

#define CRU_SPLLCONSET_Msk                    _UINT32_(0x00000000)                                 /* (CRU_SPLLCONSET) Register Mask  */


/* -------- CRU_SPLLCONINV : (CRU Offset: 0x2C) (R/W 32)  -------- */
#define CRU_SPLLCONINV_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_SPLLCONINV)   Reset Value */

#define CRU_SPLLCONINV_Msk                    _UINT32_(0x00000000)                                 /* (CRU_SPLLCONINV) Register Mask  */


/* -------- CRU_UPLLCON : (CRU Offset: 0x30) (R/W 32) UPLL CONTROL REGISTER -------- */
#define CRU_UPLLCON_RESETVALUE                _UINT32_(0x80000808)                                 /*  (CRU_UPLLCON) UPLL CONTROL REGISTER  Reset Value */

#define CRU_UPLLCON_UPLLBSWSEL_Pos            _UINT32_(0)                                          /* (CRU_UPLLCON) UPLL Bandwidth Select Position */
#define CRU_UPLLCON_UPLLBSWSEL_Msk            (_UINT32_(0x7) << CRU_UPLLCON_UPLLBSWSEL_Pos)        /* (CRU_UPLLCON) UPLL Bandwidth Select Mask */
#define CRU_UPLLCON_UPLLBSWSEL(value)         (CRU_UPLLCON_UPLLBSWSEL_Msk & (_UINT32_(value) << CRU_UPLLCON_UPLLBSWSEL_Pos)) /* Assigment of value for UPLLBSWSEL in the CRU_UPLLCON register */
#define   CRU_UPLLCON_UPLLBSWSEL_400KHz_Val   _UINT32_(0x1)                                        /* (CRU_UPLLCON) UPLL closed loop bandwith 400KHz  */
#define   CRU_UPLLCON_UPLLBSWSEL_1MHz_Val     _UINT32_(0x2)                                        /* (CRU_UPLLCON) UPLL closed loop bandwith 1MHz  */
#define   CRU_UPLLCON_UPLLBSWSEL_2MHz_Val     _UINT32_(0x3)                                        /* (CRU_UPLLCON) UPLL closed loop bandwith 2MHz  */
#define   CRU_UPLLCON_UPLLBSWSEL_3MHz_Val     _UINT32_(0x4)                                        /* (CRU_UPLLCON) UPLL closed loop bandwith 3MHz  */
#define CRU_UPLLCON_UPLLBSWSEL_400KHz         (CRU_UPLLCON_UPLLBSWSEL_400KHz_Val << CRU_UPLLCON_UPLLBSWSEL_Pos) /* (CRU_UPLLCON) UPLL closed loop bandwith 400KHz Position  */
#define CRU_UPLLCON_UPLLBSWSEL_1MHz           (CRU_UPLLCON_UPLLBSWSEL_1MHz_Val << CRU_UPLLCON_UPLLBSWSEL_Pos) /* (CRU_UPLLCON) UPLL closed loop bandwith 1MHz Position  */
#define CRU_UPLLCON_UPLLBSWSEL_2MHz           (CRU_UPLLCON_UPLLBSWSEL_2MHz_Val << CRU_UPLLCON_UPLLBSWSEL_Pos) /* (CRU_UPLLCON) UPLL closed loop bandwith 2MHz Position  */
#define CRU_UPLLCON_UPLLBSWSEL_3MHz           (CRU_UPLLCON_UPLLBSWSEL_3MHz_Val << CRU_UPLLCON_UPLLBSWSEL_Pos) /* (CRU_UPLLCON) UPLL closed loop bandwith 3MHz Position  */
#define CRU_UPLLCON_UPLLPWDN_Pos              _UINT32_(3)                                          /* (CRU_UPLLCON) UPLL Power Down Register bit Position */
#define CRU_UPLLCON_UPLLPWDN_Msk              (_UINT32_(0x1) << CRU_UPLLCON_UPLLPWDN_Pos)          /* (CRU_UPLLCON) UPLL Power Down Register bit Mask */
#define CRU_UPLLCON_UPLLPWDN(value)           (CRU_UPLLCON_UPLLPWDN_Msk & (_UINT32_(value) << CRU_UPLLCON_UPLLPWDN_Pos)) /* Assigment of value for UPLLPWDN in the CRU_UPLLCON register */
#define   CRU_UPLLCON_UPLLPWDN_PLL_OFF_Val    _UINT32_(0x1)                                        /* (CRU_UPLLCON) UPLL is powered down  */
#define   CRU_UPLLCON_UPLLPWDN_PLL_ON_Val     _UINT32_(0x0)                                        /* (CRU_UPLLCON) UPLL is active  */
#define CRU_UPLLCON_UPLLPWDN_PLL_OFF          (CRU_UPLLCON_UPLLPWDN_PLL_OFF_Val << CRU_UPLLCON_UPLLPWDN_Pos) /* (CRU_UPLLCON) UPLL is powered down Position  */
#define CRU_UPLLCON_UPLLPWDN_PLL_ON           (CRU_UPLLCON_UPLLPWDN_PLL_ON_Val << CRU_UPLLCON_UPLLPWDN_Pos) /* (CRU_UPLLCON) UPLL is active Position  */
#define CRU_UPLLCON_UPLLPOSTDIV1_Pos          _UINT32_(4)                                          /* (CRU_UPLLCON) First Post Divide Value in between 1 and 63, value of 0 is unused. Position */
#define CRU_UPLLCON_UPLLPOSTDIV1_Msk          (_UINT32_(0x3F) << CRU_UPLLCON_UPLLPOSTDIV1_Pos)     /* (CRU_UPLLCON) First Post Divide Value in between 1 and 63, value of 0 is unused. Mask */
#define CRU_UPLLCON_UPLLPOSTDIV1(value)       (CRU_UPLLCON_UPLLPOSTDIV1_Msk & (_UINT32_(value) << CRU_UPLLCON_UPLLPOSTDIV1_Pos)) /* Assigment of value for UPLLPOSTDIV1 in the CRU_UPLLCON register */
#define CRU_UPLLCON_UPLLFLOCK_Pos             _UINT32_(10)                                         /* (CRU_UPLLCON) USB PLL Force Lock Position */
#define CRU_UPLLCON_UPLLFLOCK_Msk             (_UINT32_(0x1) << CRU_UPLLCON_UPLLFLOCK_Pos)         /* (CRU_UPLLCON) USB PLL Force Lock Mask */
#define CRU_UPLLCON_UPLLFLOCK(value)          (CRU_UPLLCON_UPLLFLOCK_Msk & (_UINT32_(value) << CRU_UPLLCON_UPLLFLOCK_Pos)) /* Assigment of value for UPLLFLOCK in the CRU_UPLLCON register */
#define   CRU_UPLLCON_UPLLFLOCK_ASSERT_Val    _UINT32_(0x1)                                        /* (CRU_UPLLCON) Force the UPLL lock signal to be asserted  */
#define   CRU_UPLLCON_UPLLFLOCK_NO_ASSERT_Val _UINT32_(0x0)                                        /* (CRU_UPLLCON) Do not force the SPLL lock signal to be asserted  */
#define CRU_UPLLCON_UPLLFLOCK_ASSERT          (CRU_UPLLCON_UPLLFLOCK_ASSERT_Val << CRU_UPLLCON_UPLLFLOCK_Pos) /* (CRU_UPLLCON) Force the UPLL lock signal to be asserted Position  */
#define CRU_UPLLCON_UPLLFLOCK_NO_ASSERT       (CRU_UPLLCON_UPLLFLOCK_NO_ASSERT_Val << CRU_UPLLCON_UPLLFLOCK_Pos) /* (CRU_UPLLCON) Do not force the SPLL lock signal to be asserted Position  */
#define CRU_UPLLCON_UPLLRST_Pos               _UINT32_(11)                                         /* (CRU_UPLLCON) USB PLL Reset Position */
#define CRU_UPLLCON_UPLLRST_Msk               (_UINT32_(0x1) << CRU_UPLLCON_UPLLRST_Pos)           /* (CRU_UPLLCON) USB PLL Reset Mask */
#define CRU_UPLLCON_UPLLRST(value)            (CRU_UPLLCON_UPLLRST_Msk & (_UINT32_(value) << CRU_UPLLCON_UPLLRST_Pos)) /* Assigment of value for UPLLRST in the CRU_UPLLCON register */
#define   CRU_UPLLCON_UPLLRST_ASSERT_Val      _UINT32_(0x1)                                        /* (CRU_UPLLCON) Assert the reset to the UPLL  */
#define   CRU_UPLLCON_UPLLRST_NO_ASSERT_Val   _UINT32_(0x0)                                        /* (CRU_UPLLCON) De-assert the reset to the UPLL  */
#define CRU_UPLLCON_UPLLRST_ASSERT            (CRU_UPLLCON_UPLLRST_ASSERT_Val << CRU_UPLLCON_UPLLRST_Pos) /* (CRU_UPLLCON) Assert the reset to the UPLL Position  */
#define CRU_UPLLCON_UPLLRST_NO_ASSERT         (CRU_UPLLCON_UPLLRST_NO_ASSERT_Val << CRU_UPLLCON_UPLLRST_Pos) /* (CRU_UPLLCON) De-assert the reset to the UPLL Position  */
#define CRU_UPLLCON_UPLLFBDIV_Pos             _UINT32_(12)                                         /* (CRU_UPLLCON) PLL feedback divider in between 16 and 1023, values of 0 to 15 are unused Position */
#define CRU_UPLLCON_UPLLFBDIV_Msk             (_UINT32_(0x3FF) << CRU_UPLLCON_UPLLFBDIV_Pos)       /* (CRU_UPLLCON) PLL feedback divider in between 16 and 1023, values of 0 to 15 are unused Mask */
#define CRU_UPLLCON_UPLLFBDIV(value)          (CRU_UPLLCON_UPLLFBDIV_Msk & (_UINT32_(value) << CRU_UPLLCON_UPLLFBDIV_Pos)) /* Assigment of value for UPLLFBDIV in the CRU_UPLLCON register */
#define CRU_UPLLCON_UPLLREFDIV_Pos            _UINT32_(22)                                         /* (CRU_UPLLCON) Reference Frequency Divide in between 1 and 63, value of 0 is unused. Position */
#define CRU_UPLLCON_UPLLREFDIV_Msk            (_UINT32_(0x3F) << CRU_UPLLCON_UPLLREFDIV_Pos)       /* (CRU_UPLLCON) Reference Frequency Divide in between 1 and 63, value of 0 is unused. Mask */
#define CRU_UPLLCON_UPLLREFDIV(value)         (CRU_UPLLCON_UPLLREFDIV_Msk & (_UINT32_(value) << CRU_UPLLCON_UPLLREFDIV_Pos)) /* Assigment of value for UPLLREFDIV in the CRU_UPLLCON register */
#define CRU_UPLLCON_UPLL_BYP_Pos              _UINT32_(31)                                         /* (CRU_UPLLCON) The input clock REF bypasses PLL to PLLOUTx Position */
#define CRU_UPLLCON_UPLL_BYP_Msk              (_UINT32_(0x1) << CRU_UPLLCON_UPLL_BYP_Pos)          /* (CRU_UPLLCON) The input clock REF bypasses PLL to PLLOUTx Mask */
#define CRU_UPLLCON_UPLL_BYP(value)           (CRU_UPLLCON_UPLL_BYP_Msk & (_UINT32_(value) << CRU_UPLLCON_UPLL_BYP_Pos)) /* Assigment of value for UPLL_BYP in the CRU_UPLLCON register */
#define   CRU_UPLLCON_UPLL_BYP_BYPASS_Val     _UINT32_(0x1)                                        /* (CRU_UPLLCON) UPLL Bypass; when this bit is set, the input clock REF bypasses PLL to PLLOUTx  */
#define   CRU_UPLLCON_UPLL_BYP_NOT_BYPASS_Val _UINT32_(0x0)                                        /* (CRU_UPLLCON) The input clock dont bypass  */
#define CRU_UPLLCON_UPLL_BYP_BYPASS           (CRU_UPLLCON_UPLL_BYP_BYPASS_Val << CRU_UPLLCON_UPLL_BYP_Pos) /* (CRU_UPLLCON) UPLL Bypass; when this bit is set, the input clock REF bypasses PLL to PLLOUTx Position  */
#define CRU_UPLLCON_UPLL_BYP_NOT_BYPASS       (CRU_UPLLCON_UPLL_BYP_NOT_BYPASS_Val << CRU_UPLLCON_UPLL_BYP_Pos) /* (CRU_UPLLCON) The input clock dont bypass Position  */
#define CRU_UPLLCON_Msk                       _UINT32_(0x8FFFFFFF)                                 /* (CRU_UPLLCON) Register Mask  */


/* -------- CRU_UPLLCONCLR : (CRU Offset: 0x34) (R/W 32)  -------- */
#define CRU_UPLLCONCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_UPLLCONCLR)   Reset Value */

#define CRU_UPLLCONCLR_Msk                    _UINT32_(0x00000000)                                 /* (CRU_UPLLCONCLR) Register Mask  */


/* -------- CRU_UPLLCONSET : (CRU Offset: 0x38) (R/W 32)  -------- */
#define CRU_UPLLCONSET_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_UPLLCONSET)   Reset Value */

#define CRU_UPLLCONSET_Msk                    _UINT32_(0x00000000)                                 /* (CRU_UPLLCONSET) Register Mask  */


/* -------- CRU_UPLLCONINV : (CRU Offset: 0x3C) (R/W 32)  -------- */
#define CRU_UPLLCONINV_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_UPLLCONINV)   Reset Value */

#define CRU_UPLLCONINV_Msk                    _UINT32_(0x00000000)                                 /* (CRU_UPLLCONINV) Register Mask  */


/* -------- CRU_EPLLCON : (CRU Offset: 0x40) (R/W 32) EPLL CONTROL REGISTER -------- */
#define CRU_EPLLCON_RESETVALUE                _UINT32_(0x80000808)                                 /*  (CRU_EPLLCON) EPLL CONTROL REGISTER  Reset Value */

#define CRU_EPLLCON_EPLLBSWSEL_Pos            _UINT32_(0)                                          /* (CRU_EPLLCON) EPLL Bandwidth Select Position */
#define CRU_EPLLCON_EPLLBSWSEL_Msk            (_UINT32_(0x7) << CRU_EPLLCON_EPLLBSWSEL_Pos)        /* (CRU_EPLLCON) EPLL Bandwidth Select Mask */
#define CRU_EPLLCON_EPLLBSWSEL(value)         (CRU_EPLLCON_EPLLBSWSEL_Msk & (_UINT32_(value) << CRU_EPLLCON_EPLLBSWSEL_Pos)) /* Assigment of value for EPLLBSWSEL in the CRU_EPLLCON register */
#define   CRU_EPLLCON_EPLLBSWSEL_400KHz_Val   _UINT32_(0x1)                                        /* (CRU_EPLLCON) EPLL closed loop bandwith 400KHz  */
#define   CRU_EPLLCON_EPLLBSWSEL_1MHz_Val     _UINT32_(0x2)                                        /* (CRU_EPLLCON) EPLL closed loop bandwith 1MHz  */
#define   CRU_EPLLCON_EPLLBSWSEL_2MHz_Val     _UINT32_(0x3)                                        /* (CRU_EPLLCON) EPLL closed loop bandwith 2MHz  */
#define   CRU_EPLLCON_EPLLBSWSEL_3MHz_Val     _UINT32_(0x4)                                        /* (CRU_EPLLCON) EPLL closed loop bandwith 3MHz  */
#define CRU_EPLLCON_EPLLBSWSEL_400KHz         (CRU_EPLLCON_EPLLBSWSEL_400KHz_Val << CRU_EPLLCON_EPLLBSWSEL_Pos) /* (CRU_EPLLCON) EPLL closed loop bandwith 400KHz Position  */
#define CRU_EPLLCON_EPLLBSWSEL_1MHz           (CRU_EPLLCON_EPLLBSWSEL_1MHz_Val << CRU_EPLLCON_EPLLBSWSEL_Pos) /* (CRU_EPLLCON) EPLL closed loop bandwith 1MHz Position  */
#define CRU_EPLLCON_EPLLBSWSEL_2MHz           (CRU_EPLLCON_EPLLBSWSEL_2MHz_Val << CRU_EPLLCON_EPLLBSWSEL_Pos) /* (CRU_EPLLCON) EPLL closed loop bandwith 2MHz Position  */
#define CRU_EPLLCON_EPLLBSWSEL_3MHz           (CRU_EPLLCON_EPLLBSWSEL_3MHz_Val << CRU_EPLLCON_EPLLBSWSEL_Pos) /* (CRU_EPLLCON) EPLL closed loop bandwith 3MHz Position  */
#define CRU_EPLLCON_EPLLPWDN_Pos              _UINT32_(3)                                          /* (CRU_EPLLCON) EPLL Power Down Register bit Position */
#define CRU_EPLLCON_EPLLPWDN_Msk              (_UINT32_(0x1) << CRU_EPLLCON_EPLLPWDN_Pos)          /* (CRU_EPLLCON) EPLL Power Down Register bit Mask */
#define CRU_EPLLCON_EPLLPWDN(value)           (CRU_EPLLCON_EPLLPWDN_Msk & (_UINT32_(value) << CRU_EPLLCON_EPLLPWDN_Pos)) /* Assigment of value for EPLLPWDN in the CRU_EPLLCON register */
#define   CRU_EPLLCON_EPLLPWDN_PLL_OFF_Val    _UINT32_(0x1)                                        /* (CRU_EPLLCON) EPLL is powered down  */
#define   CRU_EPLLCON_EPLLPWDN_PLL_ON_Val     _UINT32_(0x0)                                        /* (CRU_EPLLCON) EPLL is active  */
#define CRU_EPLLCON_EPLLPWDN_PLL_OFF          (CRU_EPLLCON_EPLLPWDN_PLL_OFF_Val << CRU_EPLLCON_EPLLPWDN_Pos) /* (CRU_EPLLCON) EPLL is powered down Position  */
#define CRU_EPLLCON_EPLLPWDN_PLL_ON           (CRU_EPLLCON_EPLLPWDN_PLL_ON_Val << CRU_EPLLCON_EPLLPWDN_Pos) /* (CRU_EPLLCON) EPLL is active Position  */
#define CRU_EPLLCON_EPLLPOSTDIV1_Pos          _UINT32_(4)                                          /* (CRU_EPLLCON) First Post Divide Value in between 1 and 63, value of 0 is unused. Position */
#define CRU_EPLLCON_EPLLPOSTDIV1_Msk          (_UINT32_(0x3F) << CRU_EPLLCON_EPLLPOSTDIV1_Pos)     /* (CRU_EPLLCON) First Post Divide Value in between 1 and 63, value of 0 is unused. Mask */
#define CRU_EPLLCON_EPLLPOSTDIV1(value)       (CRU_EPLLCON_EPLLPOSTDIV1_Msk & (_UINT32_(value) << CRU_EPLLCON_EPLLPOSTDIV1_Pos)) /* Assigment of value for EPLLPOSTDIV1 in the CRU_EPLLCON register */
#define CRU_EPLLCON_EPLLFLOCK_Pos             _UINT32_(10)                                         /* (CRU_EPLLCON) Ethernet PLL Force Lock Position */
#define CRU_EPLLCON_EPLLFLOCK_Msk             (_UINT32_(0x1) << CRU_EPLLCON_EPLLFLOCK_Pos)         /* (CRU_EPLLCON) Ethernet PLL Force Lock Mask */
#define CRU_EPLLCON_EPLLFLOCK(value)          (CRU_EPLLCON_EPLLFLOCK_Msk & (_UINT32_(value) << CRU_EPLLCON_EPLLFLOCK_Pos)) /* Assigment of value for EPLLFLOCK in the CRU_EPLLCON register */
#define   CRU_EPLLCON_EPLLFLOCK_ASSERT_Val    _UINT32_(0x1)                                        /* (CRU_EPLLCON) Force the EPLL lock signal to be asserted  */
#define   CRU_EPLLCON_EPLLFLOCK_NO_ASSERT_Val _UINT32_(0x0)                                        /* (CRU_EPLLCON) Do not force the SPLL lock signal to be asserted  */
#define CRU_EPLLCON_EPLLFLOCK_ASSERT          (CRU_EPLLCON_EPLLFLOCK_ASSERT_Val << CRU_EPLLCON_EPLLFLOCK_Pos) /* (CRU_EPLLCON) Force the EPLL lock signal to be asserted Position  */
#define CRU_EPLLCON_EPLLFLOCK_NO_ASSERT       (CRU_EPLLCON_EPLLFLOCK_NO_ASSERT_Val << CRU_EPLLCON_EPLLFLOCK_Pos) /* (CRU_EPLLCON) Do not force the SPLL lock signal to be asserted Position  */
#define CRU_EPLLCON_EPLLRST_Pos               _UINT32_(11)                                         /* (CRU_EPLLCON) Ethernet PLL Reset Position */
#define CRU_EPLLCON_EPLLRST_Msk               (_UINT32_(0x1) << CRU_EPLLCON_EPLLRST_Pos)           /* (CRU_EPLLCON) Ethernet PLL Reset Mask */
#define CRU_EPLLCON_EPLLRST(value)            (CRU_EPLLCON_EPLLRST_Msk & (_UINT32_(value) << CRU_EPLLCON_EPLLRST_Pos)) /* Assigment of value for EPLLRST in the CRU_EPLLCON register */
#define   CRU_EPLLCON_EPLLRST_ASSERT_Val      _UINT32_(0x1)                                        /* (CRU_EPLLCON) Assert the reset to the EPLL  */
#define   CRU_EPLLCON_EPLLRST_NO_ASSERT_Val   _UINT32_(0x0)                                        /* (CRU_EPLLCON) De-assert the reset to the EPLL  */
#define CRU_EPLLCON_EPLLRST_ASSERT            (CRU_EPLLCON_EPLLRST_ASSERT_Val << CRU_EPLLCON_EPLLRST_Pos) /* (CRU_EPLLCON) Assert the reset to the EPLL Position  */
#define CRU_EPLLCON_EPLLRST_NO_ASSERT         (CRU_EPLLCON_EPLLRST_NO_ASSERT_Val << CRU_EPLLCON_EPLLRST_Pos) /* (CRU_EPLLCON) De-assert the reset to the EPLL Position  */
#define CRU_EPLLCON_EPLLFBDIV_Pos             _UINT32_(12)                                         /* (CRU_EPLLCON) PLL feedback divider in between 16 and 1023, values of 0 to 15 are unused Position */
#define CRU_EPLLCON_EPLLFBDIV_Msk             (_UINT32_(0x3FF) << CRU_EPLLCON_EPLLFBDIV_Pos)       /* (CRU_EPLLCON) PLL feedback divider in between 16 and 1023, values of 0 to 15 are unused Mask */
#define CRU_EPLLCON_EPLLFBDIV(value)          (CRU_EPLLCON_EPLLFBDIV_Msk & (_UINT32_(value) << CRU_EPLLCON_EPLLFBDIV_Pos)) /* Assigment of value for EPLLFBDIV in the CRU_EPLLCON register */
#define CRU_EPLLCON_EPLLREFDIV_Pos            _UINT32_(22)                                         /* (CRU_EPLLCON) Reference Frequency Divide in between 1 and 63, value of 0 is unused. Position */
#define CRU_EPLLCON_EPLLREFDIV_Msk            (_UINT32_(0x3F) << CRU_EPLLCON_EPLLREFDIV_Pos)       /* (CRU_EPLLCON) Reference Frequency Divide in between 1 and 63, value of 0 is unused. Mask */
#define CRU_EPLLCON_EPLLREFDIV(value)         (CRU_EPLLCON_EPLLREFDIV_Msk & (_UINT32_(value) << CRU_EPLLCON_EPLLREFDIV_Pos)) /* Assigment of value for EPLLREFDIV in the CRU_EPLLCON register */
#define CRU_EPLLCON_ECLKOUTEN_Pos             _UINT32_(28)                                         /* (CRU_EPLLCON) Ethernet Clock Out pin Enable Position */
#define CRU_EPLLCON_ECLKOUTEN_Msk             (_UINT32_(0x1) << CRU_EPLLCON_ECLKOUTEN_Pos)         /* (CRU_EPLLCON) Ethernet Clock Out pin Enable Mask */
#define CRU_EPLLCON_ECLKOUTEN(value)          (CRU_EPLLCON_ECLKOUTEN_Msk & (_UINT32_(value) << CRU_EPLLCON_ECLKOUTEN_Pos)) /* Assigment of value for ECLKOUTEN in the CRU_EPLLCON register */
#define   CRU_EPLLCON_ECLKOUTEN_Enable_Val    _UINT32_(0x1)                                        /* (CRU_EPLLCON) ETH_CLK_OUT Pin is enabled  */
#define   CRU_EPLLCON_ECLKOUTEN_Disable_Val   _UINT32_(0x0)                                        /* (CRU_EPLLCON) ETH_CLK_OUT Pin is disabled  */
#define CRU_EPLLCON_ECLKOUTEN_Enable          (CRU_EPLLCON_ECLKOUTEN_Enable_Val << CRU_EPLLCON_ECLKOUTEN_Pos) /* (CRU_EPLLCON) ETH_CLK_OUT Pin is enabled Position  */
#define CRU_EPLLCON_ECLKOUTEN_Disable         (CRU_EPLLCON_ECLKOUTEN_Disable_Val << CRU_EPLLCON_ECLKOUTEN_Pos) /* (CRU_EPLLCON) ETH_CLK_OUT Pin is disabled Position  */
#define CRU_EPLLCON_EPLL_BYP_Pos              _UINT32_(31)                                         /* (CRU_EPLLCON) The input clock REF bypasses PLL to PLLOUTx Position */
#define CRU_EPLLCON_EPLL_BYP_Msk              (_UINT32_(0x1) << CRU_EPLLCON_EPLL_BYP_Pos)          /* (CRU_EPLLCON) The input clock REF bypasses PLL to PLLOUTx Mask */
#define CRU_EPLLCON_EPLL_BYP(value)           (CRU_EPLLCON_EPLL_BYP_Msk & (_UINT32_(value) << CRU_EPLLCON_EPLL_BYP_Pos)) /* Assigment of value for EPLL_BYP in the CRU_EPLLCON register */
#define   CRU_EPLLCON_EPLL_BYP_BYPASS_Val     _UINT32_(0x1)                                        /* (CRU_EPLLCON) EPLL Bypass; when this bit is set, the input clock REF bypasses PLL to PLLOUTx  */
#define   CRU_EPLLCON_EPLL_BYP_NOT_BYPASS_Val _UINT32_(0x0)                                        /* (CRU_EPLLCON) The input clock dont bypass  */
#define CRU_EPLLCON_EPLL_BYP_BYPASS           (CRU_EPLLCON_EPLL_BYP_BYPASS_Val << CRU_EPLLCON_EPLL_BYP_Pos) /* (CRU_EPLLCON) EPLL Bypass; when this bit is set, the input clock REF bypasses PLL to PLLOUTx Position  */
#define CRU_EPLLCON_EPLL_BYP_NOT_BYPASS       (CRU_EPLLCON_EPLL_BYP_NOT_BYPASS_Val << CRU_EPLLCON_EPLL_BYP_Pos) /* (CRU_EPLLCON) The input clock dont bypass Position  */
#define CRU_EPLLCON_Msk                       _UINT32_(0x9FFFFFFF)                                 /* (CRU_EPLLCON) Register Mask  */


/* -------- CRU_EPLLCONCLR : (CRU Offset: 0x44) (R/W 32)  -------- */
#define CRU_EPLLCONCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_EPLLCONCLR)   Reset Value */

#define CRU_EPLLCONCLR_Msk                    _UINT32_(0x00000000)                                 /* (CRU_EPLLCONCLR) Register Mask  */


/* -------- CRU_EPLLCONSET : (CRU Offset: 0x48) (R/W 32)  -------- */
#define CRU_EPLLCONSET_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_EPLLCONSET)   Reset Value */

#define CRU_EPLLCONSET_Msk                    _UINT32_(0x00000000)                                 /* (CRU_EPLLCONSET) Register Mask  */


/* -------- CRU_EPLLCONINV : (CRU Offset: 0x4C) (R/W 32)  -------- */
#define CRU_EPLLCONINV_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_EPLLCONINV)   Reset Value */

