Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/cru.h
#define CRU_EPLLCONINV_Msk                    _UINT32_(0x00000000)                                 /* (CRU_EPLLCONINV) Register Mask  */


/* -------- CRU_APLLCON : (CRU Offset: 0x50) (R/W 32) APLL CONTROL REGISTER -------- */
#define CRU_APLLCON_RESETVALUE                _UINT32_(0x00)                                       /*  (CRU_APLLCON) APLL CONTROL REGISTER  Reset Value */

#define CRU_APLLCON_EPLLPOSTIDIV2_Pos         _UINT32_(0)                                          /* (CRU_APLLCON) EPLL Post Divider bits for controlling second PLL clock output, value of 0 is unused. Position */
#define CRU_APLLCON_EPLLPOSTIDIV2_Msk         (_UINT32_(0x3F) << CRU_APLLCON_EPLLPOSTIDIV2_Pos)    /* (CRU_APLLCON) EPLL Post Divider bits for controlling second PLL clock output, value of 0 is unused. Mask */
#define CRU_APLLCON_EPLLPOSTIDIV2(value)      (CRU_APLLCON_EPLLPOSTIDIV2_Msk & (_UINT32_(value) << CRU_APLLCON_EPLLPOSTIDIV2_Pos)) /* Assigment of value for EPLLPOSTIDIV2 in the CRU_APLLCON register */
#define CRU_APLLCON_Msk                       _UINT32_(0x0000003F)                                 /* (CRU_APLLCON) Register Mask  */


/* -------- CRU_APLLCONCLR : (CRU Offset: 0x54) (R/W 32)  -------- */
#define CRU_APLLCONCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_APLLCONCLR)   Reset Value */

#define CRU_APLLCONCLR_Msk                    _UINT32_(0x00000000)                                 /* (CRU_APLLCONCLR) Register Mask  */


/* -------- CRU_APLLCONSET : (CRU Offset: 0x58) (R/W 32)  -------- */
#define CRU_APLLCONSET_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_APLLCONSET)   Reset Value */

#define CRU_APLLCONSET_Msk                    _UINT32_(0x00000000)                                 /* (CRU_APLLCONSET) Register Mask  */


/* -------- CRU_APLLCONINV : (CRU Offset: 0x5C) (R/W 32)  -------- */
#define CRU_APLLCONINV_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_APLLCONINV)   Reset Value */

#define CRU_APLLCONINV_Msk                    _UINT32_(0x00000000)                                 /* (CRU_APLLCONINV) Register Mask  */


/* -------- CRU_REFO1CON : (CRU Offset: 0xA0) (R/W 32) REFERENCE OSCILLATOR 1 CONTROL REGISTER -------- */
#define CRU_REFO1CON_RESETVALUE               _UINT32_(0x00)                                       /*  (CRU_REFO1CON) REFERENCE OSCILLATOR 1 CONTROL REGISTER  Reset Value */

#define CRU_REFO1CON_ROSEL_Pos                _UINT32_(0)                                          /* (CRU_REFO1CON) Reference Clock Source Select bits Position */
#define CRU_REFO1CON_ROSEL_Msk                (_UINT32_(0xF) << CRU_REFO1CON_ROSEL_Pos)            /* (CRU_REFO1CON) Reference Clock Source Select bits Mask */
#define CRU_REFO1CON_ROSEL(value)             (CRU_REFO1CON_ROSEL_Msk & (_UINT32_(value) << CRU_REFO1CON_ROSEL_Pos)) /* Assigment of value for ROSEL in the CRU_REFO1CON register */
#define   CRU_REFO1CON_ROSEL_REFCLKI_Val      _UINT32_(0xB)                                        /* (CRU_REFO1CON) REFI Pin  */
#define   CRU_REFO1CON_ROSEL_SYSCLK_Val       _UINT32_(0xA)                                        /* (CRU_REFO1CON) System clock (reference clock reflects any device clock switching)  */
#define   CRU_REFO1CON_ROSEL_PBCLK1_Val       _UINT32_(0x9)                                        /* (CRU_REFO1CON) Peripheral clock 1 (reference clock reflects any peripheral clock switching)  */
#define   CRU_REFO1CON_ROSEL_EPLL1_Val        _UINT32_(0x8)                                        /* (CRU_REFO1CON) Ethernet PLL1 (Clock-1)  */
#define   CRU_REFO1CON_ROSEL_SPLL3_Val        _UINT32_(0x7)                                        /* (CRU_REFO1CON) System PLL3 (Clock-3)  */
#define   CRU_REFO1CON_ROSEL_USBPLL_Val       _UINT32_(0x6)                                        /* (CRU_REFO1CON) USB PLL  */
#define   CRU_REFO1CON_ROSEL_EPLL2_Val        _UINT32_(0x5)                                        /* (CRU_REFO1CON) Ethernet PLL2 (Clock-2)  */
#define   CRU_REFO1CON_ROSEL_LPRC_Val         _UINT32_(0x4)                                        /* (CRU_REFO1CON) LPRC  */
#define   CRU_REFO1CON_ROSEL_SOSC_Val         _UINT32_(0x3)                                        /* (CRU_REFO1CON) SOSC  */
#define   CRU_REFO1CON_ROSEL_POSC_Val         _UINT32_(0x2)                                        /* (CRU_REFO1CON) POSC  */
#define   CRU_REFO1CON_ROSEL_SPLL1_Val        _UINT32_(0x1)                                        /* (CRU_REFO1CON) System PLL1 (Clock-1)  */
#define   CRU_REFO1CON_ROSEL_FRC_Val          _UINT32_(0x0)                                        /* (CRU_REFO1CON) FRC  */
#define CRU_REFO1CON_ROSEL_REFCLKI            (CRU_REFO1CON_ROSEL_REFCLKI_Val << CRU_REFO1CON_ROSEL_Pos) /* (CRU_REFO1CON) REFI Pin Position  */
#define CRU_REFO1CON_ROSEL_SYSCLK             (CRU_REFO1CON_ROSEL_SYSCLK_Val << CRU_REFO1CON_ROSEL_Pos) /* (CRU_REFO1CON) System clock (reference clock reflects any device clock switching) Position  */
#define CRU_REFO1CON_ROSEL_PBCLK1             (CRU_REFO1CON_ROSEL_PBCLK1_Val << CRU_REFO1CON_ROSEL_Pos) /* (CRU_REFO1CON) Peripheral clock 1 (reference clock reflects any peripheral clock switching) Position  */
#define CRU_REFO1CON_ROSEL_EPLL1              (CRU_REFO1CON_ROSEL_EPLL1_Val << CRU_REFO1CON_ROSEL_Pos) /* (CRU_REFO1CON) Ethernet PLL1 (Clock-1) Position  */
#define CRU_REFO1CON_ROSEL_SPLL3              (CRU_REFO1CON_ROSEL_SPLL3_Val << CRU_REFO1CON_ROSEL_Pos) /* (CRU_REFO1CON) System PLL3 (Clock-3) Position  */
#define CRU_REFO1CON_ROSEL_USBPLL             (CRU_REFO1CON_ROSEL_USBPLL_Val << CRU_REFO1CON_ROSEL_Pos) /* (CRU_REFO1CON) USB PLL Position  */
#define CRU_REFO1CON_ROSEL_EPLL2              (CRU_REFO1CON_ROSEL_EPLL2_Val << CRU_REFO1CON_ROSEL_Pos) /* (CRU_REFO1CON) Ethernet PLL2 (Clock-2) Position  */
#define CRU_REFO1CON_ROSEL_LPRC               (CRU_REFO1CON_ROSEL_LPRC_Val << CRU_REFO1CON_ROSEL_Pos) /* (CRU_REFO1CON) LPRC Position  */
#define CRU_REFO1CON_ROSEL_SOSC               (CRU_REFO1CON_ROSEL_SOSC_Val << CRU_REFO1CON_ROSEL_Pos) /* (CRU_REFO1CON) SOSC Position  */
#define CRU_REFO1CON_ROSEL_POSC               (CRU_REFO1CON_ROSEL_POSC_Val << CRU_REFO1CON_ROSEL_Pos) /* (CRU_REFO1CON) POSC Position  */
#define CRU_REFO1CON_ROSEL_SPLL1              (CRU_REFO1CON_ROSEL_SPLL1_Val << CRU_REFO1CON_ROSEL_Pos) /* (CRU_REFO1CON) System PLL1 (Clock-1) Position  */
#define CRU_REFO1CON_ROSEL_FRC                (CRU_REFO1CON_ROSEL_FRC_Val << CRU_REFO1CON_ROSEL_Pos) /* (CRU_REFO1CON) FRC Position  */
#define CRU_REFO1CON_ACTIVE_Pos               _UINT32_(8)                                          /* (CRU_REFO1CON) Reference Clock Request Status bit Position */
#define CRU_REFO1CON_ACTIVE_Msk               (_UINT32_(0x1) << CRU_REFO1CON_ACTIVE_Pos)           /* (CRU_REFO1CON) Reference Clock Request Status bit Mask */
#define CRU_REFO1CON_ACTIVE(value)            (CRU_REFO1CON_ACTIVE_Msk & (_UINT32_(value) << CRU_REFO1CON_ACTIVE_Pos)) /* Assigment of value for ACTIVE in the CRU_REFO1CON register */
#define   CRU_REFO1CON_ACTIVE_ACTIVE_Val      _UINT32_(0x1)                                        /* (CRU_REFO1CON) Reference clock request is active (User should not update this REFOCON register)  */
#define   CRU_REFO1CON_ACTIVE_NOT_ACTIVE_Val  _UINT32_(0x0)                                        /* (CRU_REFO1CON) Reference clock request is not active (User can update this REFOCON register)  */
#define CRU_REFO1CON_ACTIVE_ACTIVE            (CRU_REFO1CON_ACTIVE_ACTIVE_Val << CRU_REFO1CON_ACTIVE_Pos) /* (CRU_REFO1CON) Reference clock request is active (User should not update this REFOCON register) Position  */
#define CRU_REFO1CON_ACTIVE_NOT_ACTIVE        (CRU_REFO1CON_ACTIVE_NOT_ACTIVE_Val << CRU_REFO1CON_ACTIVE_Pos) /* (CRU_REFO1CON) Reference clock request is not active (User can update this REFOCON register) Position  */
#define CRU_REFO1CON_DIVSWEN_Pos              _UINT32_(9)                                          /* (CRU_REFO1CON) Clock RODIV/ROTRIM switch enabled. Position */
#define CRU_REFO1CON_DIVSWEN_Msk              (_UINT32_(0x1) << CRU_REFO1CON_DIVSWEN_Pos)          /* (CRU_REFO1CON) Clock RODIV/ROTRIM switch enabled. Mask */
#define CRU_REFO1CON_DIVSWEN(value)           (CRU_REFO1CON_DIVSWEN_Msk & (_UINT32_(value) << CRU_REFO1CON_DIVSWEN_Pos)) /* Assigment of value for DIVSWEN in the CRU_REFO1CON register */
#define   CRU_REFO1CON_DIVSWEN_SWINPROGRESS_Val _UINT32_(0x1)                                        /* (CRU_REFO1CON) Clock Divider Switching currently in progress.  */
#define   CRU_REFO1CON_DIVSWEN_SWCOMPLETE_Val _UINT32_(0x0)                                        /* (CRU_REFO1CON) Clock Divider Switch has completed.  */
#define CRU_REFO1CON_DIVSWEN_SWINPROGRESS     (CRU_REFO1CON_DIVSWEN_SWINPROGRESS_Val << CRU_REFO1CON_DIVSWEN_Pos) /* (CRU_REFO1CON) Clock Divider Switching currently in progress. Position  */
#define CRU_REFO1CON_DIVSWEN_SWCOMPLETE       (CRU_REFO1CON_DIVSWEN_SWCOMPLETE_Val << CRU_REFO1CON_DIVSWEN_Pos) /* (CRU_REFO1CON) Clock Divider Switch has completed. Position  */
#define CRU_REFO1CON_RSLP_Pos                 _UINT32_(11)                                         /* (CRU_REFO1CON) Reference Oscillator Run in Sleep bit Position */
#define CRU_REFO1CON_RSLP_Msk                 (_UINT32_(0x1) << CRU_REFO1CON_RSLP_Pos)             /* (CRU_REFO1CON) Reference Oscillator Run in Sleep bit Mask */
#define CRU_REFO1CON_RSLP(value)              (CRU_REFO1CON_RSLP_Msk & (_UINT32_(value) << CRU_REFO1CON_RSLP_Pos)) /* Assigment of value for RSLP in the CRU_REFO1CON register */
#define   CRU_REFO1CON_RSLP_RSLP_Val          _UINT32_(0x1)                                        /* (CRU_REFO1CON) Reference Oscillator output continues to run in Sleep  */
#define   CRU_REFO1CON_RSLP_NO_RSLP_Val       _UINT32_(0x0)                                        /* (CRU_REFO1CON) Reference Oscillator output is disabled in Sleep  */
#define CRU_REFO1CON_RSLP_RSLP                (CRU_REFO1CON_RSLP_RSLP_Val << CRU_REFO1CON_RSLP_Pos) /* (CRU_REFO1CON) Reference Oscillator output continues to run in Sleep Position  */
#define CRU_REFO1CON_RSLP_NO_RSLP             (CRU_REFO1CON_RSLP_NO_RSLP_Val << CRU_REFO1CON_RSLP_Pos) /* (CRU_REFO1CON) Reference Oscillator output is disabled in Sleep Position  */
#define CRU_REFO1CON_OE_Pos                   _UINT32_(12)                                         /* (CRU_REFO1CON) Reference Clock Output Enable bit Position */
#define CRU_REFO1CON_OE_Msk                   (_UINT32_(0x1) << CRU_REFO1CON_OE_Pos)               /* (CRU_REFO1CON) Reference Clock Output Enable bit Mask */
#define CRU_REFO1CON_OE(value)                (CRU_REFO1CON_OE_Msk & (_UINT32_(value) << CRU_REFO1CON_OE_Pos)) /* Assigment of value for OE in the CRU_REFO1CON register */
#define   CRU_REFO1CON_OE_REFO1_OE_Val        _UINT32_(0x1)                                        /* (CRU_REFO1CON) Reference clock is driven out on REFO1 pin  */
#define   CRU_REFO1CON_OE_NO_REFO1_OE_Val     _UINT32_(0x0)                                        /* (CRU_REFO1CON) Reference clock is not driven out on REFO1 pin.  */
#define CRU_REFO1CON_OE_REFO1_OE              (CRU_REFO1CON_OE_REFO1_OE_Val << CRU_REFO1CON_OE_Pos) /* (CRU_REFO1CON) Reference clock is driven out on REFO1 pin Position  */
#define CRU_REFO1CON_OE_NO_REFO1_OE           (CRU_REFO1CON_OE_NO_REFO1_OE_Val << CRU_REFO1CON_OE_Pos) /* (CRU_REFO1CON) Reference clock is not driven out on REFO1 pin. Position  */
#define CRU_REFO1CON_SIDL_Pos                 _UINT32_(13)                                         /* (CRU_REFO1CON) Peripheral Stop in Idle Mode bit Position */
#define CRU_REFO1CON_SIDL_Msk                 (_UINT32_(0x1) << CRU_REFO1CON_SIDL_Pos)             /* (CRU_REFO1CON) Peripheral Stop in Idle Mode bit Mask */
#define CRU_REFO1CON_SIDL(value)              (CRU_REFO1CON_SIDL_Msk & (_UINT32_(value) << CRU_REFO1CON_SIDL_Pos)) /* Assigment of value for SIDL in the CRU_REFO1CON register */
#define   CRU_REFO1CON_SIDL_SIDL_Val          _UINT32_(0x1)                                        /* (CRU_REFO1CON) Discontinue module operation when device enters Idle mode  */
#define   CRU_REFO1CON_SIDL_NO_SIDL_Val       _UINT32_(0x0)                                        /* (CRU_REFO1CON) Continue module operation in Idle mode  */
#define CRU_REFO1CON_SIDL_SIDL                (CRU_REFO1CON_SIDL_SIDL_Val << CRU_REFO1CON_SIDL_Pos) /* (CRU_REFO1CON) Discontinue module operation when device enters Idle mode Position  */
#define CRU_REFO1CON_SIDL_NO_SIDL             (CRU_REFO1CON_SIDL_NO_SIDL_Val << CRU_REFO1CON_SIDL_Pos) /* (CRU_REFO1CON) Continue module operation in Idle mode Position  */
#define CRU_REFO1CON_FRZ_Pos                  _UINT32_(14)                                         /* (CRU_REFO1CON) Freeze in Debug mode bit Position */
#define CRU_REFO1CON_FRZ_Msk                  (_UINT32_(0x1) << CRU_REFO1CON_FRZ_Pos)              /* (CRU_REFO1CON) Freeze in Debug mode bit Mask */
#define CRU_REFO1CON_FRZ(value)               (CRU_REFO1CON_FRZ_Msk & (_UINT32_(value) << CRU_REFO1CON_FRZ_Pos)) /* Assigment of value for FRZ in the CRU_REFO1CON register */
#define   CRU_REFO1CON_FRZ_FRZ_Val            _UINT32_(0x1)                                        /* (CRU_REFO1CON) When emulator is in Debug mode, module freezes operation  */
#define   CRU_REFO1CON_FRZ_NO_FRZ_Val         _UINT32_(0x0)                                        /* (CRU_REFO1CON) When emulator is in Debug mode, module continues operation  */
#define CRU_REFO1CON_FRZ_FRZ                  (CRU_REFO1CON_FRZ_FRZ_Val << CRU_REFO1CON_FRZ_Pos)   /* (CRU_REFO1CON) When emulator is in Debug mode, module freezes operation Position  */
#define CRU_REFO1CON_FRZ_NO_FRZ               (CRU_REFO1CON_FRZ_NO_FRZ_Val << CRU_REFO1CON_FRZ_Pos) /* (CRU_REFO1CON) When emulator is in Debug mode, module continues operation Position  */
#define CRU_REFO1CON_ON_Pos                   _UINT32_(15)                                         /* (CRU_REFO1CON) Output Enable bit Position */
#define CRU_REFO1CON_ON_Msk                   (_UINT32_(0x1) << CRU_REFO1CON_ON_Pos)               /* (CRU_REFO1CON) Output Enable bit Mask */
#define CRU_REFO1CON_ON(value)                (CRU_REFO1CON_ON_Msk & (_UINT32_(value) << CRU_REFO1CON_ON_Pos)) /* Assigment of value for ON in the CRU_REFO1CON register */
#define   CRU_REFO1CON_ON_ON_Val              _UINT32_(0x1)                                        /* (CRU_REFO1CON) Reference Oscillator Module enabled  */
#define   CRU_REFO1CON_ON_OFF_Val             _UINT32_(0x0)                                        /* (CRU_REFO1CON) Reference Oscillator Module disabled  */
#define CRU_REFO1CON_ON_ON                    (CRU_REFO1CON_ON_ON_Val << CRU_REFO1CON_ON_Pos)      /* (CRU_REFO1CON) Reference Oscillator Module enabled Position  */
#define CRU_REFO1CON_ON_OFF                   (CRU_REFO1CON_ON_OFF_Val << CRU_REFO1CON_ON_Pos)     /* (CRU_REFO1CON) Reference Oscillator Module disabled Position  */
#define CRU_REFO1CON_RODIV_Pos                _UINT32_(16)                                         /* (CRU_REFO1CON) Reference Clock Divider bits Position */
#define CRU_REFO1CON_RODIV_Msk                (_UINT32_(0x7FFF) << CRU_REFO1CON_RODIV_Pos)         /* (CRU_REFO1CON) Reference Clock Divider bits Mask */
#define CRU_REFO1CON_RODIV(value)             (CRU_REFO1CON_RODIV_Msk & (_UINT32_(value) << CRU_REFO1CON_RODIV_Pos)) /* Assigment of value for RODIV in the CRU_REFO1CON register */
#define   CRU_REFO1CON_RODIV_65K_Val          _UINT32_(0x7FFF)                                     /* (CRU_REFO1CON) REFO1 clock is Base clock frequency divided by 65,534 (32,767 *2)  */
#define   CRU_REFO1CON_RODIV_4_Val            _UINT32_(0x2)                                        /* (CRU_REFO1CON) REFO1 clock is Base clock frequency divided by 4 (2*2)  */
#define   CRU_REFO1CON_RODIV_2_Val            _UINT32_(0x1)                                        /* (CRU_REFO1CON) REFO1 clock is Base clock frequency divided by 2 (1*2)  */
#define   CRU_REFO1CON_RODIV_NONE_Val         _UINT32_(0x0)                                        /* (CRU_REFO1CON) REFO1 clock is same frequency as Base clock (no divider)  */
#define CRU_REFO1CON_RODIV_65K                (CRU_REFO1CON_RODIV_65K_Val << CRU_REFO1CON_RODIV_Pos) /* (CRU_REFO1CON) REFO1 clock is Base clock frequency divided by 65,534 (32,767 *2) Position  */
#define CRU_REFO1CON_RODIV_4                  (CRU_REFO1CON_RODIV_4_Val << CRU_REFO1CON_RODIV_Pos) /* (CRU_REFO1CON) REFO1 clock is Base clock frequency divided by 4 (2*2) Position  */
#define CRU_REFO1CON_RODIV_2                  (CRU_REFO1CON_RODIV_2_Val << CRU_REFO1CON_RODIV_Pos) /* (CRU_REFO1CON) REFO1 clock is Base clock frequency divided by 2 (1*2) Position  */
#define CRU_REFO1CON_RODIV_NONE               (CRU_REFO1CON_RODIV_NONE_Val << CRU_REFO1CON_RODIV_Pos) /* (CRU_REFO1CON) REFO1 clock is same frequency as Base clock (no divider) Position  */
#define CRU_REFO1CON_Msk                      _UINT32_(0x7FFFFB0F)                                 /* (CRU_REFO1CON) Register Mask  */


/* -------- CRU_REFO1CONCLR : (CRU Offset: 0xA4) (R/W 32)  -------- */
#define CRU_REFO1CONCLR_RESETVALUE            _UINT32_(0x00)                                       /*  (CRU_REFO1CONCLR)   Reset Value */

