Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/cru.h
#define CRU_PB3DIVSET_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB3DIVSET) Register Mask  */


/* -------- CRU_PB3DIVINV : (CRU Offset: 0x18C) (R/W 32)  -------- */
#define CRU_PB3DIVINV_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB3DIVINV)   Reset Value */

#define CRU_PB3DIVINV_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB3DIVINV) Register Mask  */


/* -------- CRU_PB4DIV : (CRU Offset: 0x190) (R/W 32) PB4 CLOCK DIVISOR CONTROL REGISTER -------- */
#define CRU_PB4DIV_RESETVALUE                 _UINT32_(0x8801)                                     /*  (CRU_PB4DIV) PB4 CLOCK DIVISOR CONTROL REGISTER  Reset Value */

#define CRU_PB4DIV_PBDIV_Pos                  _UINT32_(0)                                          /* (CRU_PB4DIV) PB4 Peripheral Clock Divisor Control value Position */
#define CRU_PB4DIV_PBDIV_Msk                  (_UINT32_(0x7F) << CRU_PB4DIV_PBDIV_Pos)             /* (CRU_PB4DIV) PB4 Peripheral Clock Divisor Control value Mask */
#define CRU_PB4DIV_PBDIV(value)               (CRU_PB4DIV_PBDIV_Msk & (_UINT32_(value) << CRU_PB4DIV_PBDIV_Pos)) /* Assigment of value for PBDIV in the CRU_PB4DIV register */
#define   CRU_PB4DIV_PBDIV_DIV1_Val           _UINT32_(0x0)                                        /* (CRU_PB4DIV) Divide by 1 PB4 Clock same frequency as sys_clk  */
#define   CRU_PB4DIV_PBDIV_DIV2_Val           _UINT32_(0x1)                                        /* (CRU_PB4DIV) Divide by 2 PB4 Clock is 1/2 of sys_clk  */
#define   CRU_PB4DIV_PBDIV_DIV3_Val           _UINT32_(0x2)                                        /* (CRU_PB4DIV) Divide by 3 PB4 Clock is 1/3 of sys_clk  */
#define   CRU_PB4DIV_PBDIV_DIV16_Val          _UINT32_(0xF)                                        /* (CRU_PB4DIV) Divide by 16 PB4 Clock is 1/16 of sys_clk  */
#define   CRU_PB4DIV_PBDIV_DIV17_Val          _UINT32_(0x10)                                       /* (CRU_PB4DIV) Divide by 17 PB4 Clock is 1/17 of sys_clk  */
#define   CRU_PB4DIV_PBDIV_DIV127_Val         _UINT32_(0x7E)                                       /* (CRU_PB4DIV) Divide by 127 PB4 Clock is 1/127 of sys_clk  */
#define   CRU_PB4DIV_PBDIV_DIV128_Val         _UINT32_(0x7F)                                       /* (CRU_PB4DIV) Divide by 128 PB4 Clock is 1/128 of sys_clk  */
#define CRU_PB4DIV_PBDIV_DIV1                 (CRU_PB4DIV_PBDIV_DIV1_Val << CRU_PB4DIV_PBDIV_Pos)  /* (CRU_PB4DIV) Divide by 1 PB4 Clock same frequency as sys_clk Position  */
#define CRU_PB4DIV_PBDIV_DIV2                 (CRU_PB4DIV_PBDIV_DIV2_Val << CRU_PB4DIV_PBDIV_Pos)  /* (CRU_PB4DIV) Divide by 2 PB4 Clock is 1/2 of sys_clk Position  */
#define CRU_PB4DIV_PBDIV_DIV3                 (CRU_PB4DIV_PBDIV_DIV3_Val << CRU_PB4DIV_PBDIV_Pos)  /* (CRU_PB4DIV) Divide by 3 PB4 Clock is 1/3 of sys_clk Position  */
#define CRU_PB4DIV_PBDIV_DIV16                (CRU_PB4DIV_PBDIV_DIV16_Val << CRU_PB4DIV_PBDIV_Pos) /* (CRU_PB4DIV) Divide by 16 PB4 Clock is 1/16 of sys_clk Position  */
#define CRU_PB4DIV_PBDIV_DIV17                (CRU_PB4DIV_PBDIV_DIV17_Val << CRU_PB4DIV_PBDIV_Pos) /* (CRU_PB4DIV) Divide by 17 PB4 Clock is 1/17 of sys_clk Position  */
#define CRU_PB4DIV_PBDIV_DIV127               (CRU_PB4DIV_PBDIV_DIV127_Val << CRU_PB4DIV_PBDIV_Pos) /* (CRU_PB4DIV) Divide by 127 PB4 Clock is 1/127 of sys_clk Position  */
#define CRU_PB4DIV_PBDIV_DIV128               (CRU_PB4DIV_PBDIV_DIV128_Val << CRU_PB4DIV_PBDIV_Pos) /* (CRU_PB4DIV) Divide by 128 PB4 Clock is 1/128 of sys_clk Position  */
#define CRU_PB4DIV_PBDIVRDY_Pos               _UINT32_(11)                                         /* (CRU_PB4DIV) PB4 Peripheral Clock Divisor Ready Position */
#define CRU_PB4DIV_PBDIVRDY_Msk               (_UINT32_(0x1) << CRU_PB4DIV_PBDIVRDY_Pos)           /* (CRU_PB4DIV) PB4 Peripheral Clock Divisor Ready Mask */
#define CRU_PB4DIV_PBDIVRDY(value)            (CRU_PB4DIV_PBDIVRDY_Msk & (_UINT32_(value) << CRU_PB4DIV_PBDIVRDY_Pos)) /* Assigment of value for PBDIVRDY in the CRU_PB4DIV register */
#define   CRU_PB4DIV_PBDIVRDY_PB4RDY_Val      _UINT32_(0x1)                                        /* (CRU_PB4DIV) Indicates the PB clock divisor logic is not switching divisors and the PB4DIV may be written.  */
#define   CRU_PB4DIV_PBDIVRDY_NOT_PB4RDY_Val  _UINT32_(0x0)                                        /* (CRU_PB4DIV) Indicates the PB clock divisor logic is currently switching values and the PB4DIV cannot be written.  */
#define CRU_PB4DIV_PBDIVRDY_PB4RDY            (CRU_PB4DIV_PBDIVRDY_PB4RDY_Val << CRU_PB4DIV_PBDIVRDY_Pos) /* (CRU_PB4DIV) Indicates the PB clock divisor logic is not switching divisors and the PB4DIV may be written. Position  */
#define CRU_PB4DIV_PBDIVRDY_NOT_PB4RDY        (CRU_PB4DIV_PBDIVRDY_NOT_PB4RDY_Val << CRU_PB4DIV_PBDIVRDY_Pos) /* (CRU_PB4DIV) Indicates the PB clock divisor logic is currently switching values and the PB4DIV cannot be written. Position  */
#define CRU_PB4DIV_PBDIVON_Pos                _UINT32_(15)                                         /* (CRU_PB4DIV) Output Enable bit Position */
#define CRU_PB4DIV_PBDIVON_Msk                (_UINT32_(0x1) << CRU_PB4DIV_PBDIVON_Pos)            /* (CRU_PB4DIV) Output Enable bit Mask */
#define CRU_PB4DIV_PBDIVON(value)             (CRU_PB4DIV_PBDIVON_Msk & (_UINT32_(value) << CRU_PB4DIV_PBDIVON_Pos)) /* Assigment of value for PBDIVON in the CRU_PB4DIV register */
#define   CRU_PB4DIV_PBDIVON_PB4ON_Val        _UINT32_(0x1)                                        /* (CRU_PB4DIV) PB4 Output clock is enabled  */
#define   CRU_PB4DIV_PBDIVON_PB4OFF_Val       _UINT32_(0x0)                                        /* (CRU_PB4DIV) PB4 Output clock is disabled  */
#define CRU_PB4DIV_PBDIVON_PB4ON              (CRU_PB4DIV_PBDIVON_PB4ON_Val << CRU_PB4DIV_PBDIVON_Pos) /* (CRU_PB4DIV) PB4 Output clock is enabled Position  */
#define CRU_PB4DIV_PBDIVON_PB4OFF             (CRU_PB4DIV_PBDIVON_PB4OFF_Val << CRU_PB4DIV_PBDIVON_Pos) /* (CRU_PB4DIV) PB4 Output clock is disabled Position  */
#define CRU_PB4DIV_Msk                        _UINT32_(0x0000887F)                                 /* (CRU_PB4DIV) Register Mask  */


/* -------- CRU_PB4DIVCLR : (CRU Offset: 0x194) (R/W 32)  -------- */
#define CRU_PB4DIVCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB4DIVCLR)   Reset Value */

