Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/qspi/qspi_read_write/src/packs/PIC32CX2051BZ62132_DFP/component/cru.h
/* -------- CRU_SLEWCONSET : (CRU Offset: 0x1B8) (R/W 32)  -------- */
#define CRU_SLEWCONSET_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_SLEWCONSET)   Reset Value */

#define CRU_SLEWCONSET_Msk                    _UINT32_(0x00000000)                                 /* (CRU_SLEWCONSET) Register Mask  */


/* -------- CRU_SLEWCONINV : (CRU Offset: 0x1BC) (R/W 32)  -------- */
#define CRU_SLEWCONINV_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_SLEWCONINV)   Reset Value */

#define CRU_SLEWCONINV_Msk                    _UINT32_(0x00000000)                                 /* (CRU_SLEWCONINV) Register Mask  */


/* -------- CRU_CLKSTAT : (CRU Offset: 0x1C0) (R/W 32) CLOCK STATUS REGISTER -------- */
#define CRU_CLKSTAT_RESETVALUE                _UINT32_(0x00)                                       /*  (CRU_CLKSTAT) CLOCK STATUS REGISTER  Reset Value */

#define CRU_CLKSTAT_FRCRDY_Pos                _UINT32_(0)                                          /* (CRU_CLKSTAT) FRC Ready Status value Position */
#define CRU_CLKSTAT_FRCRDY_Msk                (_UINT32_(0x1) << CRU_CLKSTAT_FRCRDY_Pos)            /* (CRU_CLKSTAT) FRC Ready Status value Mask */
#define CRU_CLKSTAT_FRCRDY(value)             (CRU_CLKSTAT_FRCRDY_Msk & (_UINT32_(value) << CRU_CLKSTAT_FRCRDY_Pos)) /* Assigment of value for FRCRDY in the CRU_CLKSTAT register */
#define   CRU_CLKSTAT_FRCRDY_NOTRDY_Val       _UINT32_(0x0)                                        /* (CRU_CLKSTAT) FRC is not stable and not ready  */
#define   CRU_CLKSTAT_FRCRDY_RDY_Val          _UINT32_(0x1)                                        /* (CRU_CLKSTAT) FRC is stable and ready  */
#define CRU_CLKSTAT_FRCRDY_NOTRDY             (CRU_CLKSTAT_FRCRDY_NOTRDY_Val << CRU_CLKSTAT_FRCRDY_Pos) /* (CRU_CLKSTAT) FRC is not stable and not ready Position  */
#define CRU_CLKSTAT_FRCRDY_RDY                (CRU_CLKSTAT_FRCRDY_RDY_Val << CRU_CLKSTAT_FRCRDY_Pos) /* (CRU_CLKSTAT) FRC is stable and ready Position  */
#define CRU_CLKSTAT_SPLL1RDY_Pos              _UINT32_(1)                                          /* (CRU_CLKSTAT) System PLL1 Ready Status value Position */
#define CRU_CLKSTAT_SPLL1RDY_Msk              (_UINT32_(0x1) << CRU_CLKSTAT_SPLL1RDY_Pos)          /* (CRU_CLKSTAT) System PLL1 Ready Status value Mask */
#define CRU_CLKSTAT_SPLL1RDY(value)           (CRU_CLKSTAT_SPLL1RDY_Msk & (_UINT32_(value) << CRU_CLKSTAT_SPLL1RDY_Pos)) /* Assigment of value for SPLL1RDY in the CRU_CLKSTAT register */
#define   CRU_CLKSTAT_SPLL1RDY_NOTRDY_Val     _UINT32_(0x0)                                        /* (CRU_CLKSTAT) SPLL1 Primary Output is not stable and not ready  */
#define   CRU_CLKSTAT_SPLL1RDY_RDY_Val        _UINT32_(0x1)                                        /* (CRU_CLKSTAT) SPLL1 Primary Output is stable and ready  */
#define CRU_CLKSTAT_SPLL1RDY_NOTRDY           (CRU_CLKSTAT_SPLL1RDY_NOTRDY_Val << CRU_CLKSTAT_SPLL1RDY_Pos) /* (CRU_CLKSTAT) SPLL1 Primary Output is not stable and not ready Position  */
#define CRU_CLKSTAT_SPLL1RDY_RDY              (CRU_CLKSTAT_SPLL1RDY_RDY_Val << CRU_CLKSTAT_SPLL1RDY_Pos) /* (CRU_CLKSTAT) SPLL1 Primary Output is stable and ready Position  */
#define CRU_CLKSTAT_POSCRDY_Pos               _UINT32_(2)                                          /* (CRU_CLKSTAT) Primary Oscillator Ready Status value Position */
#define CRU_CLKSTAT_POSCRDY_Msk               (_UINT32_(0x1) << CRU_CLKSTAT_POSCRDY_Pos)           /* (CRU_CLKSTAT) Primary Oscillator Ready Status value Mask */
#define CRU_CLKSTAT_POSCRDY(value)            (CRU_CLKSTAT_POSCRDY_Msk & (_UINT32_(value) << CRU_CLKSTAT_POSCRDY_Pos)) /* Assigment of value for POSCRDY in the CRU_CLKSTAT register */
#define   CRU_CLKSTAT_POSCRDY_NOTRDY_Val      _UINT32_(0x0)                                        /* (CRU_CLKSTAT) POSC is not stable and not ready  */
#define   CRU_CLKSTAT_POSCRDY_RDY_Val         _UINT32_(0x1)                                        /* (CRU_CLKSTAT) POSC is stable and ready  */
#define CRU_CLKSTAT_POSCRDY_NOTRDY            (CRU_CLKSTAT_POSCRDY_NOTRDY_Val << CRU_CLKSTAT_POSCRDY_Pos) /* (CRU_CLKSTAT) POSC is not stable and not ready Position  */
#define CRU_CLKSTAT_POSCRDY_RDY               (CRU_CLKSTAT_POSCRDY_RDY_Val << CRU_CLKSTAT_POSCRDY_Pos) /* (CRU_CLKSTAT) POSC is stable and ready Position  */
#define CRU_CLKSTAT_SOSCRDY_Pos               _UINT32_(3)                                          /* (CRU_CLKSTAT) SOSC Ready Status value Position */
#define CRU_CLKSTAT_SOSCRDY_Msk               (_UINT32_(0x1) << CRU_CLKSTAT_SOSCRDY_Pos)           /* (CRU_CLKSTAT) SOSC Ready Status value Mask */
#define CRU_CLKSTAT_SOSCRDY(value)            (CRU_CLKSTAT_SOSCRDY_Msk & (_UINT32_(value) << CRU_CLKSTAT_SOSCRDY_Pos)) /* Assigment of value for SOSCRDY in the CRU_CLKSTAT register */
#define   CRU_CLKSTAT_SOSCRDY_NOTRDY_Val      _UINT32_(0x0)                                        /* (CRU_CLKSTAT) SOSC is not stable and not ready  */
#define   CRU_CLKSTAT_SOSCRDY_RDY_Val         _UINT32_(0x1)                                        /* (CRU_CLKSTAT) SOSC is stable and ready  */
#define CRU_CLKSTAT_SOSCRDY_NOTRDY            (CRU_CLKSTAT_SOSCRDY_NOTRDY_Val << CRU_CLKSTAT_SOSCRDY_Pos) /* (CRU_CLKSTAT) SOSC is not stable and not ready Position  */
#define CRU_CLKSTAT_SOSCRDY_RDY               (CRU_CLKSTAT_SOSCRDY_RDY_Val << CRU_CLKSTAT_SOSCRDY_Pos) /* (CRU_CLKSTAT) SOSC is stable and ready Position  */
#define CRU_CLKSTAT_LPRCRDY_Pos               _UINT32_(4)                                          /* (CRU_CLKSTAT) LPRC Ready Status value Position */
#define CRU_CLKSTAT_LPRCRDY_Msk               (_UINT32_(0x1) << CRU_CLKSTAT_LPRCRDY_Pos)           /* (CRU_CLKSTAT) LPRC Ready Status value Mask */
#define CRU_CLKSTAT_LPRCRDY(value)            (CRU_CLKSTAT_LPRCRDY_Msk & (_UINT32_(value) << CRU_CLKSTAT_LPRCRDY_Pos)) /* Assigment of value for LPRCRDY in the CRU_CLKSTAT register */
#define   CRU_CLKSTAT_LPRCRDY_NOTRDY_Val      _UINT32_(0x0)                                        /* (CRU_CLKSTAT) LPRC is not stable and not ready  */
#define   CRU_CLKSTAT_LPRCRDY_RDY_Val         _UINT32_(0x1)                                        /* (CRU_CLKSTAT) LPRC is stable and ready  */
#define CRU_CLKSTAT_LPRCRDY_NOTRDY            (CRU_CLKSTAT_LPRCRDY_NOTRDY_Val << CRU_CLKSTAT_LPRCRDY_Pos) /* (CRU_CLKSTAT) LPRC is not stable and not ready Position  */
#define CRU_CLKSTAT_LPRCRDY_RDY               (CRU_CLKSTAT_LPRCRDY_RDY_Val << CRU_CLKSTAT_LPRCRDY_Pos) /* (CRU_CLKSTAT) LPRC is stable and ready Position  */
#define CRU_CLKSTAT_EPLL2RDY_Pos              _UINT32_(5)                                          /* (CRU_CLKSTAT) Ethernet PLL2 Ready Status value Position */
#define CRU_CLKSTAT_EPLL2RDY_Msk              (_UINT32_(0x1) << CRU_CLKSTAT_EPLL2RDY_Pos)          /* (CRU_CLKSTAT) Ethernet PLL2 Ready Status value Mask */
#define CRU_CLKSTAT_EPLL2RDY(value)           (CRU_CLKSTAT_EPLL2RDY_Msk & (_UINT32_(value) << CRU_CLKSTAT_EPLL2RDY_Pos)) /* Assigment of value for EPLL2RDY in the CRU_CLKSTAT register */
#define   CRU_CLKSTAT_EPLL2RDY_NOTRDY_Val     _UINT32_(0x0)                                        /* (CRU_CLKSTAT) EPLL2 is not stable and not ready  */
#define   CRU_CLKSTAT_EPLL2RDY_RDY_Val        _UINT32_(0x1)                                        /* (CRU_CLKSTAT) EPLL2 is stable and ready  */
#define CRU_CLKSTAT_EPLL2RDY_NOTRDY           (CRU_CLKSTAT_EPLL2RDY_NOTRDY_Val << CRU_CLKSTAT_EPLL2RDY_Pos) /* (CRU_CLKSTAT) EPLL2 is not stable and not ready Position  */
#define CRU_CLKSTAT_EPLL2RDY_RDY              (CRU_CLKSTAT_EPLL2RDY_RDY_Val << CRU_CLKSTAT_EPLL2RDY_Pos) /* (CRU_CLKSTAT) EPLL2 is stable and ready Position  */
#define CRU_CLKSTAT_UPLLRDY_Pos               _UINT32_(6)                                          /* (CRU_CLKSTAT) USB PLL Ready Status value Position */
#define CRU_CLKSTAT_UPLLRDY_Msk               (_UINT32_(0x1) << CRU_CLKSTAT_UPLLRDY_Pos)           /* (CRU_CLKSTAT) USB PLL Ready Status value Mask */
#define CRU_CLKSTAT_UPLLRDY(value)            (CRU_CLKSTAT_UPLLRDY_Msk & (_UINT32_(value) << CRU_CLKSTAT_UPLLRDY_Pos)) /* Assigment of value for UPLLRDY in the CRU_CLKSTAT register */
#define   CRU_CLKSTAT_UPLLRDY_NOTRDY_Val      _UINT32_(0x0)                                        /* (CRU_CLKSTAT) UPLL is not stable and not ready  */
#define   CRU_CLKSTAT_UPLLRDY_RDY_Val         _UINT32_(0x1)                                        /* (CRU_CLKSTAT) UPLL is stable and ready  */
#define CRU_CLKSTAT_UPLLRDY_NOTRDY            (CRU_CLKSTAT_UPLLRDY_NOTRDY_Val << CRU_CLKSTAT_UPLLRDY_Pos) /* (CRU_CLKSTAT) UPLL is not stable and not ready Position  */
#define CRU_CLKSTAT_UPLLRDY_RDY               (CRU_CLKSTAT_UPLLRDY_RDY_Val << CRU_CLKSTAT_UPLLRDY_Pos) /* (CRU_CLKSTAT) UPLL is stable and ready Position  */
#define CRU_CLKSTAT_SPLLRDY_Pos               _UINT32_(7)                                          /* (CRU_CLKSTAT) System PLL Ready Status value Position */
#define CRU_CLKSTAT_SPLLRDY_Msk               (_UINT32_(0x1) << CRU_CLKSTAT_SPLLRDY_Pos)           /* (CRU_CLKSTAT) System PLL Ready Status value Mask */
#define CRU_CLKSTAT_SPLLRDY(value)            (CRU_CLKSTAT_SPLLRDY_Msk & (_UINT32_(value) << CRU_CLKSTAT_SPLLRDY_Pos)) /* Assigment of value for SPLLRDY in the CRU_CLKSTAT register */
#define   CRU_CLKSTAT_SPLLRDY_NOTRDY_Val      _UINT32_(0x0)                                        /* (CRU_CLKSTAT) SPLL is not stable and not ready  */
#define   CRU_CLKSTAT_SPLLRDY_RDY_Val         _UINT32_(0x1)                                        /* (CRU_CLKSTAT) SPLL is stable and ready  */
#define CRU_CLKSTAT_SPLLRDY_NOTRDY            (CRU_CLKSTAT_SPLLRDY_NOTRDY_Val << CRU_CLKSTAT_SPLLRDY_Pos) /* (CRU_CLKSTAT) SPLL is not stable and not ready Position  */
#define CRU_CLKSTAT_SPLLRDY_RDY               (CRU_CLKSTAT_SPLLRDY_RDY_Val << CRU_CLKSTAT_SPLLRDY_Pos) /* (CRU_CLKSTAT) SPLL is stable and ready Position  */
#define CRU_CLKSTAT_EPLL1RDY_Pos              _UINT32_(8)                                          /* (CRU_CLKSTAT) Ethernet PLL1 Ready Status value Position */
#define CRU_CLKSTAT_EPLL1RDY_Msk              (_UINT32_(0x1) << CRU_CLKSTAT_EPLL1RDY_Pos)          /* (CRU_CLKSTAT) Ethernet PLL1 Ready Status value Mask */
#define CRU_CLKSTAT_EPLL1RDY(value)           (CRU_CLKSTAT_EPLL1RDY_Msk & (_UINT32_(value) << CRU_CLKSTAT_EPLL1RDY_Pos)) /* Assigment of value for EPLL1RDY in the CRU_CLKSTAT register */
#define   CRU_CLKSTAT_EPLL1RDY_NOTRDY_Val     _UINT32_(0x0)                                        /* (CRU_CLKSTAT) EPLL1 is not stable and not ready  */
#define   CRU_CLKSTAT_EPLL1RDY_RDY_Val        _UINT32_(0x1)                                        /* (CRU_CLKSTAT) EPLL1 is stable and ready  */
#define CRU_CLKSTAT_EPLL1RDY_NOTRDY           (CRU_CLKSTAT_EPLL1RDY_NOTRDY_Val << CRU_CLKSTAT_EPLL1RDY_Pos) /* (CRU_CLKSTAT) EPLL1 is not stable and not ready Position  */
#define CRU_CLKSTAT_EPLL1RDY_RDY              (CRU_CLKSTAT_EPLL1RDY_RDY_Val << CRU_CLKSTAT_EPLL1RDY_Pos) /* (CRU_CLKSTAT) EPLL1 is stable and ready Position  */
#define CRU_CLKSTAT_SYSRDY_Pos                _UINT32_(9)                                          /* (CRU_CLKSTAT) System Clock Ready Status value Position */
#define CRU_CLKSTAT_SYSRDY_Msk                (_UINT32_(0x1) << CRU_CLKSTAT_SYSRDY_Pos)            /* (CRU_CLKSTAT) System Clock Ready Status value Mask */
#define CRU_CLKSTAT_SYSRDY(value)             (CRU_CLKSTAT_SYSRDY_Msk & (_UINT32_(value) << CRU_CLKSTAT_SYSRDY_Pos)) /* Assigment of value for SYSRDY in the CRU_CLKSTAT register */
#define   CRU_CLKSTAT_SYSRDY_NOTRDY_Val       _UINT32_(0x0)                                        /* (CRU_CLKSTAT) System clock is not stable and not ready  */
#define   CRU_CLKSTAT_SYSRDY_RDY_Val          _UINT32_(0x1)                                        /* (CRU_CLKSTAT) System clock is stable and ready  */
#define CRU_CLKSTAT_SYSRDY_NOTRDY             (CRU_CLKSTAT_SYSRDY_NOTRDY_Val << CRU_CLKSTAT_SYSRDY_Pos) /* (CRU_CLKSTAT) System clock is not stable and not ready Position  */
#define CRU_CLKSTAT_SYSRDY_RDY                (CRU_CLKSTAT_SYSRDY_RDY_Val << CRU_CLKSTAT_SYSRDY_Pos) /* (CRU_CLKSTAT) System clock is stable and ready Position  */
#define CRU_CLKSTAT_PB1RDY_Pos                _UINT32_(10)                                         /* (CRU_CLKSTAT) PB1 Clock Ready Status value  Position */
#define CRU_CLKSTAT_PB1RDY_Msk                (_UINT32_(0x1) << CRU_CLKSTAT_PB1RDY_Pos)            /* (CRU_CLKSTAT) PB1 Clock Ready Status value  Mask */
#define CRU_CLKSTAT_PB1RDY(value)             (CRU_CLKSTAT_PB1RDY_Msk & (_UINT32_(value) << CRU_CLKSTAT_PB1RDY_Pos)) /* Assigment of value for PB1RDY in the CRU_CLKSTAT register */
#define   CRU_CLKSTAT_PB1RDY_NOTRDY_Val       _UINT32_(0x0)                                        /* (CRU_CLKSTAT) PB1 clock is not stable and not ready  */
#define   CRU_CLKSTAT_PB1RDY_RDY_Val          _UINT32_(0x1)                                        /* (CRU_CLKSTAT) PB1 clock is stable and ready  */
#define CRU_CLKSTAT_PB1RDY_NOTRDY             (CRU_CLKSTAT_PB1RDY_NOTRDY_Val << CRU_CLKSTAT_PB1RDY_Pos) /* (CRU_CLKSTAT) PB1 clock is not stable and not ready Position  */
#define CRU_CLKSTAT_PB1RDY_RDY                (CRU_CLKSTAT_PB1RDY_RDY_Val << CRU_CLKSTAT_PB1RDY_Pos) /* (CRU_CLKSTAT) PB1 clock is stable and ready Position  */
#define CRU_CLKSTAT_Msk                       _UINT32_(0x000007FF)                                 /* (CRU_CLKSTAT) Register Mask  */


/* -------- CRU_CLKSTATCLR : (CRU Offset: 0x1C4) (R/W 32)  -------- */
#define CRU_CLKSTATCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (CRU_CLKSTATCLR)   Reset Value */

#define CRU_CLKSTATCLR_Msk                    _UINT32_(0x00000000)                                 /* (CRU_CLKSTATCLR) Register Mask  */


